Tekla.Structures.Solid.ISolid
The ISolid interface represents a physical object in the model or a drawing created by a part instance.
The solid instance can be used to query the actual geometry of the part.

Tekla.Structures.Solid.ISolid.MinimumPoint
The minimum axis-aligned point of the solid in the current plane.

Tekla.Structures.Solid.ISolid.MaximumPoint
The maximum axis-aligned point of the solid in the current plane.

Tekla.Structures.Solid.ISolid.GetFaceEnumerator
Returns a new face enumerator in the current plane.
Returns: A face enumerator to enumerate through the solid's faces.

Tekla.Structures.Solid.ISolid.GetEdgeEnumerator
Returns a new edge enumerator in the current plane.
Returns: An edge enumerator to enumerate through the solid's global edges.